---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorNumberOfWires
source: html/5857f4d9-e80b-d1bf-599f-8a506819fcfb.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorNumberOfWires Property

The number of wires used in the major direction (includes the first and last wires).

## Syntax (C#)
```csharp
public int MajorNumberOfWires { get; }
```